# АОДЦТН-333000/750/330
# Трансформаторы блока
# РУСН: ТНЦ-100000/330 с. 160 Неклепаев
# РУВН: 7×ОРЦ-417000/750

from numpy import array

# 1) РУСН: ТНЦ-100000/330 с. 160 Неклепаев
# 2) РУВН: 7×ОРЦ-417000/750
s_tb = array([100, 417*3])
u_sc_tb = array([11.5, 11.5])
p_sc_tb = array([2200, 800*3])
p0_b = array([480, 320*3])
# https://gostassistent.ru/doc/affb6dc4-7b25-475c-bded-4afea6a01147

# ТСН: 2×ТРДНС-40000/35 с. 134 Неклепаев
# https://powersystem.info/index.php?title=Справочные_данные_параметров_трансформаторов_от_35_кВ
u_sc_sn = 11.5
#              В-Н  С-Н
u_sc_2 = array([14, 45])
# АТ: 7×АОДЦТН-333000/750/330 с. 241 Файбисович, 162 Неклепаев
#               В-С В-Н     Н-c
u_sc_at = array([10, 28, 17])
s_at = 333 * 3
p0_at = 217 * 3
p_sc_at = 580  # В-С
